# Use of Functions in DataFrames (Part- 2)


**Note:**

1. I have tried to demonstrate various ways in which you can manipulate dataframes using Pandas.

2. Many of the operations shown here can be performed by ready-made pandas fuctions 1 line but I created functions differently for demo purpose.

3. I request you to go through each and every functions carefully, and try to implement them on your dataset to see if you are comfortable with them.

4. If you find any mistake and unable to understand mailat aniketmitra1997@gmail.com.

In [3]:
# Creating Dummy DataFrame

import pandas as pd
import numpy as np
df=pd.DataFrame({'A':np.random.randint(0,10,5),'B':['Ram','Shyam','Jadu','Rashi','Pawan'],'C':np.random.randn(5)})

In [4]:
df.head()

   A      B         C
0  7    Ram -0.014068
1  4  Shyam -0.539744
2  9   Jadu -0.281847
3  7  Rashi -1.836348
4  6  Pawan  0.641380

In [6]:
# Printing name in column B as many times as mentions in col A. Eg. Ram will be printed 7 times.

def name_repeat(x,y):
  return (' '+x)*y
df.apply(lambda r: name_repeat(r['B'],r['A']),axis=1)

# if you want to incorporate the result into the dataframe use the below code

#df['Name_Repeat']=df.apply(lambda r: name_repeat(r['B'],r['A']),axis=1)

0                      Ram Ram Ram Ram Ram Ram Ram
1                          Shyam Shyam Shyam Shyam
2     Jadu Jadu Jadu Jadu Jadu Jadu Jadu Jadu Jadu
3        Rashi Rashi Rashi Rashi Rashi Rashi Rashi
4              Pawan Pawan Pawan Pawan Pawan Pawan
dtype: object

In [ ]:
# Obtain all the names in col B with length greater than 4 using lambda function

df[df['B'].apply(lambda x: len(x)>4)]['B']

1     Shyam
3    Naresh
4     Pawan
Name: B, dtype: object

In [56]:
# Here using function we want to see if some names given in a list are present in dataframe column and return only those names

def name_check(x):
  import re
  list=['Ram','Jadu']
  for i in list:
    if i in x:
      return x
   


df['B'].apply(name_check)

0     Ram
1    None
2    Jadu
3    None
4    None
Name: B, dtype: object

In [ ]:
# Add salutation 'Mr.' before names after uppercasing them

def name_manipulate(x):
    return ('Mr. '+ x.upper())
df['B'].apply(name_manipulate)

0       Mr. RAM
1     Mr. SHYAM
2      Mr. JADU
3    Mr. NARESH
4     Mr. PAWAN
Name: B, dtype: object

In [18]:
# Create another new sample dataframe

df_=pd.DataFrame({'A':['Not Known','NaN','Yes','Yes','Yes','nan'],'B':['Hello','Morning!!','-','NaN','nan','nan']})
df_.head()

           A          B
0  Not Known      Hello
1        NaN  Morning!!
2        Yes          -
3        Yes        NaN
4        Yes        nan

In [35]:
# Count the number of words in each col that begin with 'Y' letter

def nan_val_regex(*args,pattern):

  for arg in args:
      print(arg.name,len(arg[arg.str.contains(pattern)]))
      print('------------')
  
print(nan_val_regex(df_['A'],df_['B'],pattern='^Y'))

A 3
------------
B 0
------------
None

In [38]:
# Using lambda function to replace '!' by  '$'

df_['B'].apply(lambda x: x.replace('!','$'))

0        Hello
1    Morning$$
2            -
3          NaN
4          nan
5          nan
Name: B, dtype: object

In [ ]:
# Checking missing values in columns by defining a set of missing values that can be present in the dataset. Note we use 'applymap' here instead of 'apply' . We cannot use applymap for series objecs
# i.e, for single col of DataFrame

def missing_val(x):
  if (x=='Not Known' or x=='NaN' or x=='nan' or x=='-'):
    return 'Valur not Known'
  return x
df_.applymap(missing_val)

                 A                B
0  Valur not Known            Hello
1  Valur not Known        Morning!!
2              Yes  Valur not Known
3              Yes  Valur not Known
4              Yes  Valur not Known
5  Valur not Known  Valur not Known

In [59]:
# In column A of Dataframe df we first subtract 11 from each number present in each row and then divide each of them by 12.

df['A'].apply(lambda x: (x-11)/12)

0   -0.333333
1   -0.583333
2   -0.166667
3   -0.333333
4   -0.416667
Name: A, dtype: float64

In [62]:
# The previous operation as before this time for 2 columns. Note since we are using cols it's no longer a series but a dataframe so we can also use applymap here.

df[['A','C']].apply(lambda x: (x-11)/12)

#df[['A','C']].apply(lambda x: (x-11)/12)

          A         C
0 -0.333333 -0.917839
1 -0.583333 -0.961645
2 -0.166667 -0.940154
3 -0.333333 -1.069696
4 -0.416667 -0.863218

In [ ]:
# Selecting columns with datatypes as int or float and then summing across the whole column and then dividing the sum by the standard deviation of each column.

def count(x):
  return np.sum(x)/np.std(x)
df.select_dtypes(['int','float']).apply(count)

A    5.345225
C   -0.745335
dtype: float64

In [ ]:
# Here we are doing subtraction from each row of 'A' col of Dataframe by the max value of the entire column

df['A'].transform(lambda x: x-x.max())

0   -3
1   -3
2    0
3   -6
4   -6
Name: A, dtype: int64

In [ ]:
# Creating another sample DataFrame

df1=pd.DataFrame({'Subject':['Chemistry','Physics','Maths','Biology','English','Hindi']*5,"Score_Test1":np.random.randint(10,101,30),"Score_Test2":np.random.randint(0,101,30)})

In [ ]:
df1.head()

     Subject  Score_Test1  Score_Test2
0  Chemistry           38           84
1    Physics           23            4
2      Maths           58           61
3    Biology           21           91
4    English           40            9

In [ ]:
# We are finding the average of the two test scores for each row. Note the use of groupby here.

def score_agg(x):
   x['Agg_Score']=(x['Score_Test1']+x['Score_Test2'])/2
   return x
df2=df1.groupby('Subject').apply(score_agg)
df2

      Subject  Score_Test1  Score_Test2  Agg_Score
0   Chemistry           38           84       61.0
1     Physics           23            4       13.5
2       Maths           58           61       59.5
3     Biology           21           91       56.0
4     English           40            9       24.5
5       Hindi           32           60       46.0
6   Chemistry           30           22       26.0
7     Physics           94           28       61.0
8       Maths           51           46       48.5
9     Biology           72           21       46.5
10    English           77           20       48.5
11      Hindi           43            9       26.0
12  Chemistry           86           76       81.0
13    Physics           24           27       25.5
14      Maths           41           83       62.0
15    Biology           25           89       57.0
16    English           41           44       42.5
17      Hindi           44           28       36.0
18  Chemistry           92           68       80.0
19    Physics           42           72       57.0
20      Maths           40           74       57.0
21    Biology           15           59       37.0
22    English           71           43       57.0
23      Hindi           32           18       25.0
24  Chemistry           75           23       49.0
25    Physics           55            4       29.5
26      Maths           42           50       46.0
27    Biology           84           58       71.0
28    English           45           40       42.5
29      Hindi           43           64       53.5

In [ ]:
# We can doing the mean of Agg_Score calculated in last cell across all subjects.
# First we are calcualting Agg_Score for each row as shown in above cell
# Then np.mean is used to perform the mean across each subject.

def score_agg(x):
   x['Agg_Score']=(x['Score_Test1']+x['Score_Test2'])/2
   return np.mean(x)
df1.groupby('Subject').apply(score_agg)

           Score_Test1  Score_Test2  Agg_Score
Subject
Biology           43.4         63.6       53.5
Chemistry         64.2         54.6       59.4
English           54.8         31.2       43.0
Hindi             38.8         35.8       37.3
Maths             46.4         62.8       54.6
Physics           47.6         27.0       37.3

In [ ]:
# Here we 
# 1. subtract the mean value of Agg_Score column subtract the value from each row
# 2. divide the above value with the standard deviation of the column
# 3. then obtaining the max value of the above operation for each subject

(s-s.mean())/s.std()).max()
df2.groupby('Subject')['Agg_Score'].agg(math_func)

Subject
Biology      1.377057
Chemistry    0.938864
English      1.173821
Hindi        1.302476
Maths        1.057953
Physics      1.144147
Name: Agg_Score, dtype: float64

In [ ]:
# We are calculating the the average of Agg_Score for all rows across each subject where value is greater than  40 

def avg(s,aveg):
  final=s[s>aveg]
  return final.mean()
df2.groupby(['Subject'])['Agg_Score'].agg(avg,40)

Subject
Biology      57.625
Chemistry    67.750
English      47.625
Hindi        49.750
Maths        54.600
Physics      59.000
Name: Agg_Score, dtype: float64

Same operations we 'apply' with object/string column can be applied to numerical cols too.

**If I can make functions in more innovative ways I will come out with another tutorial.**